### 📖 Terraform Plan (infra/resources/prod) - success
<details>
<summary>Show Plan</summary>

```hcl
  # module.apim.azurerm_api_management_api.send_lollipop_integration_check_api_v1 will be created
  + resource "azurerm_api_management_api" "send_lollipop_integration_check_api_v1" {
      + api_management_name   = "io-p-itn-platform-api-gateway-apim-01"
      + api_type              = (known after apply)
      + description           = "Microservizio che espone API per verificare l'integrazione SEND con Lollipop."
      + display_name          = "IO-COM SEND Lollipop Integration Check"
      + id                    = (known after apply)
      + is_current            = (known after apply)
      + is_online             = (known after apply)
      + name                  = "io-p-itn-lollipop-integration-check-api-01"
      + path                  = "api/com/v1/send/lollipop-check"
      + protocols             = [
          + "https",
        ]
      + resource_group_name   = "io-p-itn-common-rg-01"
      + revision              = "1"
      + service_url           = (known after apply)
      + subscription_required = false
      + version               = (known after apply)
      + version_set_id        = (known after apply)

      + contact {
          + name = "pagoPA - Touchpoints team"
        }

      + import {
          + content_format = "openapi-link"
          + content_value  = "https://raw.githubusercontent.com/pagopa/io-messages/060caa4dc8edcc2f1e9200750b917dd88254dfc8/apps/send-func/openapi/lollipop-integration-check.yaml"
        }

      + subscription_key_parameter_names (known after apply)
    }

  # module.apim.azurerm_api_management_api_policy.send_lollipop_integration_check_api_v1_policy will be created
  + resource "azurerm_api_management_api_policy" "send_lollipop_integration_check_api_v1_policy" {
      + api_management_name = "io-p-itn-platform-api-gateway-apim-01"
      + api_name            = "io-p-itn-lollipop-integration-check-api-01"
      + id                  = (known after apply)
      + resource_group_name = "io-p-itn-common-rg-01"
      + xml_content         = (known after apply)
      + xml_link            = "https://raw.githubusercontent.com/pagopa/io-messages/060caa4dc8edcc2f1e9200750b917dd88254dfc8/infra/resources/_modules/apim/api/send/policy.xml"
    }

  # module.apim.azurerm_api_management_product_api.send_lollipop_integration_check_api_v1_product_api will be created
  + resource "azurerm_api_management_product_api" "send_lollipop_integration_check_api_v1_product_api" {
      + api_management_name = "io-p-itn-platform-api-gateway-apim-01"
      + api_name            = "io-p-itn-lollipop-integration-check-api-01"
      + id                  = (known after apply)
      + product_id          = "io-com-product"
      + resource_group_name = "io-p-itn-common-rg-01"
    }

  # module.web_apps.module.send_func.azurerm_linux_function_app.this will be updated in-place
  ~ resource "azurerm_linux_function_app" "this" {
        id                                             = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-com-rg-01/providers/Microsoft.Web/sites/io-p-itn-com-send-func-01"
        name                                           = "io-p-itn-com-send-func-01"
        tags                                           = {
            "BusinessUnit"                           = "App IO"
            "CostCenter"                             = "TS000 - Tecnologia e Servizi"
            "CreatedBy"                              = "Terraform"
            "Environment"                            = "Prod"
            "ManagementTeam"                         = "IO Comunicazione"
            "ModuleName"                             = "azure_function_app"
            "ModuleSource"                           = "DX"
            "ModuleVersion"                          = "1.0.1"
            "Source"                                 = "https://github.com/pagopa/io-messages/blob/main/infra/resources/prod"
            "hidden-link: /app-insights-resource-id" = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-common/providers/microsoft.insights/components/io-p-ai-common"
        }
        # (34 unchanged attributes hidden)

      ~ site_config {
          ~ health_check_eviction_time_in_min             = 0 -> 2
            # (32 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }

        # (2 unchanged blocks hidden)
    }

Plan: 3 to add, 1 to change, 0 to destroy.
```

</details>
